# Link Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
Document..::..Link Method
Document Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Link(String, DWFImportOptions) | Links Markups in a DWF file into the project document. |
| Link(String, ImportOptions3DM, View) | Links a 3DM file into the project document. |
| Link(String, SATImportOptions, View) | Links an SAT file into the project document. |
| Link(String, SKPImportOptions, View) | Links a SKP file into the project document. |
| Link(String, DGNImportOptions, View, ElementId%) | Links a DGN file into the project document. |
| Link(String, DWGImportOptions, View, ElementId%) | Links a DWG or DXF file into the project document. |

# See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace